# 1) გააკეთეთ sololearn Fixing Data Types'ის ჩათვლით
# Done
# 2) ჩამოწერეთ რომელი data type'ბი იცით და ახსენით რა რას ემსახურება
# integer - რიცხვი
# string - ნებისმიერი რამ ოღონთ პრჭყალებში
# bollean - True , False
# float - 10.5


# 3) თქვენი სიტყვებით ახსენით რაში გვჭირდება მონაცემთა ტიპის შეცვლა, მაგალითად string'ის integer'ად გადაქცევა
# მონაცემთა ტიპის შეცვლა იმიტომ გვჭირდება რომ მაგალითად სტრინგებს არ შეუძლიათ რომ მიემატონ ერთმანეტთს ანუ მაგ: "5" არ შეუძლია მიემატოს "5"
# მაგრამ თუ მას უკან დავუწერთ int-ს სტრინგი ინტეჯერად გადაიქცევა და ერთმანეთს მიემატება მაგრამ ამას კოდში ვერ დავინახავთ ამას ტერმინალში ვნახავთ


# 4) მომხმარებელს შემოატანინეთ რაიმე მონაცემი და შეამოწმეთ როგორ ტიპისაა
monacemi = "str"
print(type(monacemi))
