# 1) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი
points = 50
points = 60
points = 70
print(points)
# პითონი პირველი ხაზიდან იწყებს ათვლას და გადახედავს ყველა ხაზს , და თუ რომელიმეში შეცდომაა გამოგვიტანს ერრორს. და რადგანაც პითონი იწყებს ათლას 1-იდან
# და ჩადის ბოლომდე იმ ცვლადის მნიშვნელობას გამოგვიტანს რომელიც ბოლოა.



# 2) გაასწორეთ შემდეგი კოდი:
#1age == 156
#print(("1age)
age1 = 156
print(age1)
# ცლადის სახელის დასაწყისში  რიცხვის დაწერა არ შეილება, მნიშვნელობისა და სახელს შორის (ცვლადში) უნდა ეწეროს 1 ტოლობა, პრინტს სჭირდება 2 პრჭყალი, ცვლადის სახელი პრინტში 
# სტრინგით არ იწერება.

# 3) დაწერეთ პროგრამა, რომელიც შეიცავს ორ integer ტიპის ცვლადს (მაგალითად, a და b), შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი და განაყოფი. 
a = 1
b = 2
print(a + b)
print(a // b)
print(a * b)
print(b - a)

# 4) დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.
# 12num = "hi"
# print("num12)
num12 = "hi"
print(num12)
# 5) ახსენით ოთხივე დავალება კომენტარებით