# 1) ვისწავლეთ:
# integer
# string
# float
# boolean

# თქვენი დავალება იქნება, რომ ყველა განიხილოთ რა რა არის, როგორ და რისთვის გამოიყენება და მოიყვანოთ ამ მონაცემების მაგალითები (ანუ: integer - 5, 10, 15...)

# ინტეჯერი არის რიცხვი რომლითახ პითონში ბევრი რამის გაკეთება შეგვიძლია, ერთერთია მათემატიკური ოპერაციები
print(5 + 5)

# სტრინგში შეგვიძლია ჩავსვათ რაც გვინდა ეგ და მას გარშემო შემორტყმული აქვს პრჭყალები
print("hello")
# ეს არის სტრინგი

# fლოუტი მთელი რიცხვებია მაგალითად : 2.5
print(5.0 + 5.5)

# ბულინი ბევრ რამეში გამოიყენება მაგალითად შეუძლია კითხვაზე მაგ: 5+5 გაგვცეს პასუხი სიმართლეა თუ არა
print(True)


# 2) ახსენით რა არის კონკატენაცია (concatenation)
# კონკატენაცია არის ორი შეერთებული სტრინგი


# 3) ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში
# იმიტომ,  რომ მათემატიკური ოპერაციის გამოყენება მხოლოდ შეიძლება  ინტეჯერზე და fლოატზე


# 4) კომენტარის სახით დაწერეთ პასუხი: როგორ უნდა შევამოწმო რა ტიპის არის ჩემი ცვლადი
print(type("hi"))
#პასუხი: სტრ

# 5) ჩამოწერეთ რა შედარების ოპერატორი იცით მათემატიკაში
# <
# >
# =