# 1) უყურეთ ჩანაწერში როგორ ვრეგისტრირდები sololearn'ზე და დარეგისტრირდით თქვენც
# Done

# 2) შედით პითონის კურსზე და შეასრულეთ პირველი გაკვეთილი
# Done

# 3) პითონში დაპრინტეთ თქვენი სახელი და გვარი
name = "irakli"
surname = "gegia"
print(name + " " + surname)

# 4) პითონში დაპრინტეთ რაიმე წინადადება
print("My name is Irakli")

# 5) პითონში დაპრინტეთ ორი რიცხვის ჯამი
num = 2
num1 = 5
print(num + num1)
# 6) პითონში დაპრინტეთ ორი რიცხვის ჯამი (სიმბოლოების სახით)
num2 = "2"
num3 = "3"
print(num2 + num3)
# 7) უყურეთ ამ ვიდეოს და კარგად მოუსმინეთ:
# Done